---
kind: property
id: P:Autodesk.Revit.UI.FilterDialog.NewFilterId
source: html/3f7f5aca-0f49-8938-6c77-cd6326341593.htm
---
# Autodesk.Revit.UI.FilterDialog.NewFilterId Property

The ElementId of the new filter created.
 The value is populated after Show method is executed.

## Syntax (C#)
```csharp
public ElementId NewFilterId { get; }
```